nrfconnect/sdk-nrf/applications/nrf5340_audio/src/bluetooth/le_audio_cis_gateway.c
	ret = channel_index_get(stream->conn, &channel_index);
	if (ret) {
		LOG_ERR("Channel index not found");
	} else {
		atomic_clear(&headsets[channel_index].iso_tx_pool_alloc);
		headsets[channel_index].hci_wrn_printed = false;
	}

	/* Check if the other stream is streaming, send event if not */
	if (stream == &headsets[AUDIO_CH_L].sink_stream) {
		if (!ep_state_check(headsets[AUDIO_CH_R].sink_stream.ep,
				    BT_BAP_EP_STATE_STREAMING)) {
			le_audio_event_publish(LE_AUDIO_EVT_NOT_STREAMING, stream->conn,
					       stream->ep->dir);
		}
	} else if (stream == &headsets[AUDIO_CH_R].sink_stream) {
		if (!ep_state_check(headsets[AUDIO_CH_L].sink_stream.ep,
				    BT_BAP_EP_STATE_STREAMING)) {
			le_audio_event_publish(LE_AUDIO_EVT_NOT_STREAMING, stream->conn,
					       stream->ep->dir);
		}
	} else {
		LOG_WRN("Unknown stream");
	}
}

static void stream_released_cb(struct bt_bap_stream *stream)
{
	LOG_DBG("Audio Stream %p released", (void *)stream);

	/* Check if the other stream is streaming, send event if not */
	if (stream == &headsets[AUDIO_CH_L].sink_stream) {
		if (!ep_state_check(headsets[AUDIO_CH_R].sink_stream.ep,
				    BT_BAP_EP_STATE_STREAMING)) {
			le_audio_event_publish(LE_AUDIO_EVT_NOT_STREAMING, stream->conn,
					       stream->ep->dir);
		}
	} else if (stream == &headsets[AUDIO_CH_R].sink_stream) {
		if (!ep_state_check(headsets[AUDIO_CH_L].sink_stream.ep,
				    BT_BAP_EP_STATE_STREAMING)) {
			le_audio_event_publish(LE_AUDIO_EVT_NOT_STREAMING, stream->conn,
					       stream->ep->dir);
		}
	} else {
		LOG_WRN("Unknown stream");
	}
}

#if (CONFIG_BT_AUDIO_RX)
static void stream_recv_cb(struct bt_bap_stream *stream, const struct bt_iso_recv_info *info,
			   struct net_buf *buf)
{
	int ret;
	bool bad_frame = false;
	uint8_t channel_index;

	if (receive_cb == NULL) {
		LOG_ERR("The RX callback has not been set");
		return;
	}

	if (!(info->flags & BT_ISO_FLAGS_VALID)) {
		bad_frame = true;
	}

	ret = channel_index_get(stream->conn, &channel_index);
	if (ret) {
		LOG_ERR("Channel index not found");
		return;
	}

	receive_cb(buf->data, buf->len, bad_frame, info->ts, channel_index,
		   bt_codec_cfg_get_octets_per_frame(stream->codec));
}
#endif /* (CONFIG_BT_AUDIO_RX) */

static struct bt_bap_stream_ops stream_ops = {
	.configured = stream_configured_cb,
	.qos_set = stream_qos_set_cb,
	.enabled = stream_enabled_cb,
	.started = stream_started_cb,
	.metadata_updated = stream_metadata_updated_cb,
	.disabled = stream_disabled_cb,
	.stopped = stream_stopped_cb,
	.released = stream_released_cb,
#if (CONFIG_BT_AUDIO_RX)
	.recv = stream_recv_cb,
#endif /* (CONFIG_BT_AUDIO_RX) */
#if (CONFIG_BT_AUDIO_TX)
	.sent = stream_sent_cb,
#endif /* (CONFIG_BT_AUDIO_TX) */
};

static void work_stream_start(struct k_work *work)
{
	int ret;
	struct worker_data work_data;

	ret = k_msgq_get(&kwork_msgq, &work_data, K_NO_WAIT);
	if (ret) {
		LOG_ERR("Cannot get info for start stream");
		return;
	}

	LOG_DBG("k_msg_get: ch: %d, dir: %d, retries %d", work_data.channel_index, work_data.dir,
		work_data.retries);

	if (work_data.dir == BT_AUDIO_DIR_SINK) {
		ret = bt_bap_stream_start(&headsets[work_data.channel_index].sink_stream);
	} else if (work_data.dir == BT_AUDIO_DIR_SOURCE) {
		ret = bt_bap_stream_start(&headsets[work_data.channel_index].source_stream);
	} else {
		LOG_ERR("Trying to use unknown direction");
		le_audio_event_publish(LE_AUDIO_EVT_NO_VALID_CFG,
				       headsets[work_data.channel_index].headset_conn, 0);

		return;
	}

	work_data.retries++;

	if ((ret == -EBUSY) && (work_data.retries < CIS_CONN_RETRY_TIMES)) {
		LOG_DBG("Got connect error from stream %d Retrying. code: %d count: %d",
			work_data.channel_index, ret, work_data.retries);
		LOG_DBG("k_msg_put: ch: %d, dir: %d, retries %d", work_data.channel_index,
			work_data.dir, work_data.retries);
		ret = k_msgq_put(&kwork_msgq, &work_data, K_NO_WAIT);
		if (ret) {
			LOG_ERR("No space in the queue for work_data");
			return;
		}
		/* Delay added to prevent controller overloading */
		if (work_data.dir == BT_AUDIO_DIR_SINK) {
			k_work_reschedule(&headsets[work_data.channel_index].stream_start_sink_work,
					  K_MSEC(CIS_CONN_RETRY_DELAY_MS));
		} else if (work_data.dir == BT_AUDIO_DIR_SOURCE) {
			k_work_reschedule(
				&headsets[work_data.channel_index].stream_start_source_work,
				K_MSEC(CIS_CONN_RETRY_DELAY_MS));
		}
	} else if (ret != 0) {
		LOG_ERR("Failed to establish CIS, ret = %d", ret);
		/** Defining the connection as having invalid configs, since it is not possible to
		 *  start stream
		 */
		le_audio_event_publish(LE_AUDIO_EVT_NO_VALID_CFG,
				       headsets[work_data.channel_index].headset_conn, 0);
	}
}

/**
 * @brief Set the allocation to a preset codec configuration.
 *
 * @param codec The preset codec configuration.
 * @param loc   Location bitmask setting.
 *
 */
static void bt_codec_allocation_set(struct bt_codec *codec, enum bt_audio_location loc)
{
	for (size_t i = 0; i < codec->data_count; i++) {
		if (codec->data[i].data.type == BT_CODEC_CONFIG_LC3_CHAN_ALLOC) {
			codec->data[i].value[0] = loc & 0xff;
			codec->data[i].value[1] = (loc >> 8) & 0xFFU;
			codec->data[i].value[2] = (loc >> 16) & 0xFFU;
			codec->data[i].value[3] = (loc >> 24) & 0xFFU;
			codec->data[i].data.data = codec->data[i].value;
			return;
		}
	}
}

/**
 * @brief  Check if the gateway can support the headset sink codec capabilities
 *
 * @note   Currently only the sampling frequency is checked
 *
 * @param  cap_array  The array of pointers to codec capabilities
 * @param  size       The size of cap_array
 *
 * @return True if valid codec capability found, false otherwise
 */
static bool sink_valid_codec_cap_check(struct bt_codec cap_array[], size_t size)
{
	const struct bt_codec_data *element;
	bool any_valid_found = false;

	/* Only the sampling frequency is checked */
	for (int i = 0; i < size; i++) {
		if (bt_codec_get_val(&cap_array[i], BT_CODEC_LC3_FREQ, &element)) {
			/* Try with the preferred sample rate first */
			if ((CONFIG_BT_AUDIO_PREF_SAMPLE_RATE_VALUE ==
			     BT_CODEC_CONFIG_LC3_FREQ_48KHZ) &&
			    (element->data.data[0] & BT_CODEC_LC3_FREQ_48KHZ)) {
				lc3_preset_sink = lc3_preset_sink_48_4_1;
				return true;
			} else if ((CONFIG_BT_AUDIO_PREF_SAMPLE_RATE_VALUE ==
				    BT_CODEC_CONFIG_LC3_FREQ_24KHZ) &&
				   (element->data.data[0] & BT_CODEC_LC3_FREQ_24KHZ)) {
				lc3_preset_sink = lc3_preset_sink_24_2_1;
				return true;
			} else if ((CONFIG_BT_AUDIO_PREF_SAMPLE_RATE_VALUE ==
				    BT_CODEC_CONFIG_LC3_FREQ_16KHZ) &&
				   (element->data.data[0] & BT_CODEC_LC3_FREQ_16KHZ)) {
				lc3_preset_sink = lc3_preset_sink_16_2_1;
				return true;
			}

			/* If no match with the preferred, revert to trying highest first */
			if (element->data.data[0] & BT_CODEC_LC3_FREQ_48KHZ) {
				lc3_preset_sink = lc3_preset_sink_48_4_1;
				any_valid_found = true;
			} else if (element->data.data[0] & BT_CODEC_LC3_FREQ_24KHZ) {
				lc3_preset_sink = lc3_preset_sink_24_2_1;
				any_valid_found = true;
			} else if (element->data.data[0] & BT_CODEC_LC3_FREQ_16KHZ) {
				lc3_preset_sink = lc3_preset_sink_16_2_1;
				any_valid_found = true;
			}
		}
	}

	return any_valid_found;
}

/**
 * @brief  Check if the gateway can support the headset source codec capabilities
 *
 * @note   Currently only the sampling rate is checked
 *
 * @param  cap_array  The array of pointers to codec capabilities
 * @param  size       The size of cap_array
 *
 * @return True if valid codec capability found, false otherwise
 */
static bool source_valid_codec_cap_check(struct bt_codec cap_array[], size_t size)
{
	const struct bt_codec_data *element;
	bool any_valid_found = false;

