nrfconnect/sdk-nrf/applications/nrf5340_audio/src/bluetooth/le_audio_cis_gateway.c
	/* Only the sampling rate is checked */
	for (int i = 0; i < size; i++) {
		if (bt_codec_get_val(&cap_array[i], BT_CODEC_LC3_FREQ, &element)) {
			/* Try with the preferred sample rate first */
			if ((CONFIG_BT_AUDIO_PREF_SAMPLE_RATE_VALUE ==
			     BT_CODEC_CONFIG_LC3_FREQ_48KHZ) &&
			    (element->data.data[0] & BT_CODEC_LC3_FREQ_48KHZ)) {
				lc3_preset_source = lc3_preset_source_48_4_1;
				return true;
			} else if ((CONFIG_BT_AUDIO_PREF_SAMPLE_RATE_VALUE ==
				    BT_CODEC_CONFIG_LC3_FREQ_24KHZ) &&
				   (element->data.data[0] & BT_CODEC_LC3_FREQ_24KHZ)) {
				lc3_preset_source = lc3_preset_source_24_2_1;
				return true;
			} else if ((CONFIG_BT_AUDIO_PREF_SAMPLE_RATE_VALUE ==
				    BT_CODEC_CONFIG_LC3_FREQ_16KHZ) &&
				   (element->data.data[0] & BT_CODEC_LC3_FREQ_16KHZ)) {
				lc3_preset_source = lc3_preset_source_16_2_1;
				return true;
			}

			/* If no match with the preferred, revert to trying highest first */
			if (element->data.data[0] & BT_CODEC_LC3_FREQ_48KHZ) {
				lc3_preset_source = lc3_preset_source_48_4_1;
				any_valid_found = true;
			} else if (element->data.data[0] & BT_CODEC_LC3_FREQ_24KHZ) {
				lc3_preset_source = lc3_preset_source_24_2_1;
				any_valid_found = true;
			} else if (element->data.data[0] & BT_CODEC_LC3_FREQ_16KHZ) {
				lc3_preset_source = lc3_preset_source_16_2_1;
				any_valid_found = true;
			}
		}
	}

	return any_valid_found;
}

static void discover_sink_cb(struct bt_conn *conn, int err, enum bt_audio_dir dir)
{
	int ret;
	uint8_t channel_index = 0;
	uint8_t temp_cap_index;

	if (err == BT_ATT_ERR_ATTRIBUTE_NOT_FOUND) {
		LOG_WRN("No sinks found");
		return;
	} else if (err) {
		LOG_ERR("Discovery failed: %d", err);
		return;
	}

	ret = channel_index_get(conn, &channel_index);
	if (ret) {
		LOG_ERR("Unknown connection, should not reach here");
		return;
	}

	ret = temp_cap_index_get(conn, &temp_cap_index);
	if (ret) {
		LOG_ERR("Could not get temporary CAP storage index");
		return;
	}

	/* At this point the location/channel index of the headset is always known */
	for (int i = 0; i < CONFIG_CODEC_CAP_COUNT_MAX; i++) {
		memcpy(&headsets[channel_index].sink_codec_cap[i],
		       &temp_cap[temp_cap_index].codec[i], sizeof(struct bt_codec));
	}

	LOG_DBG("Sink discover complete");

	if (sink_valid_codec_cap_check(headsets[channel_index].sink_codec_cap,
				       temp_cap[temp_cap_index].num_caps)) {
		if (conn == headsets[AUDIO_CH_L].headset_conn) {
			bt_codec_allocation_set(&lc3_preset_sink.codec,
						BT_AUDIO_LOCATION_FRONT_LEFT);
		} else if (conn == headsets[AUDIO_CH_R].headset_conn) {
			bt_codec_allocation_set(&lc3_preset_sink.codec,
						BT_AUDIO_LOCATION_FRONT_RIGHT);
		} else {
			LOG_ERR("Unknown connection, cannot set allocation");
		}

		ret = bt_bap_stream_config(conn, &headsets[channel_index].sink_stream,
					   headsets[channel_index].sink_ep, &lc3_preset_sink.codec);
		if (ret) {
			LOG_ERR("Could not configure sink stream");
		}
	} else {
		/* NOTE: The string below is used by the Nordic CI system */
		LOG_WRN("No valid codec capability found for %s headset sink",
			headsets[channel_index].ch_name);
	}

	/* Free up the slot in temp_cap */
	memset(temp_cap[temp_cap_index].codec, 0, sizeof(temp_cap[temp_cap_index].codec));
	temp_cap[temp_cap_index].conn = NULL;
	temp_cap[temp_cap_index].num_caps = 0;

	if (IS_ENABLED(CONFIG_BT_AUDIO_RX)) {
		ret = discover_source(conn);
		if (ret) {
			LOG_WRN("Failed to discover source: %d", ret);
		}
	}
}

static void discover_source_cb(struct bt_conn *conn, int err, enum bt_audio_dir dir)
{
	int ret;
	uint8_t channel_index = 0;
	uint8_t temp_cap_index;

	if (err == BT_ATT_ERR_ATTRIBUTE_NOT_FOUND) {
		LOG_WRN("No sources found");
		return;
	} else if (err) {
		LOG_ERR("Discovery failed: %d", err);
		return;
	}

	ret = channel_index_get(conn, &channel_index);
	if (ret) {
		LOG_ERR("Unknown connection, should not reach here");
		return;
	}

	ret = temp_cap_index_get(conn, &temp_cap_index);
	if (ret) {
		LOG_ERR("Could not get temporary CAP storage index");
		return;
	}

	/* At this point the location/channel index of the headset is always known */
	for (int i = 0; i < temp_cap[temp_cap_index].num_caps; i++) {
		memcpy(&headsets[channel_index].source_codec_cap[i],
		       &temp_cap[temp_cap_index].codec[i], sizeof(struct bt_codec));
	}

	LOG_DBG("Source discover complete");

	if (source_valid_codec_cap_check(headsets[channel_index].source_codec_cap,
					 temp_cap[temp_cap_index].num_caps)) {
		if (conn == headsets[AUDIO_CH_L].headset_conn) {
			bt_codec_allocation_set(&lc3_preset_source.codec,
						BT_AUDIO_LOCATION_FRONT_LEFT);
		} else if (conn == headsets[AUDIO_CH_R].headset_conn) {
			bt_codec_allocation_set(&lc3_preset_source.codec,
						BT_AUDIO_LOCATION_FRONT_RIGHT);
		} else {
			LOG_ERR("Unknown connection, cannot set allocation");
		}

		ret = bt_bap_stream_config(conn, &headsets[channel_index].source_stream,
					   headsets[channel_index].source_ep,
					   &lc3_preset_source.codec);
		if (ret) {
			LOG_WRN("Could not configure stream");
		}
	} else {
		LOG_WRN("No valid codec capability found for %s headset source",
			headsets[channel_index].ch_name);
	}

	/* Free up the slot in temp_cap */
	memset(temp_cap[temp_cap_index].codec, 0, sizeof(temp_cap[temp_cap_index].codec));
	temp_cap[temp_cap_index].conn = NULL;
	temp_cap[temp_cap_index].num_caps = 0;
}

static void disconnected_headset_cleanup(uint8_t chan_idx)
{
	headsets[chan_idx].headset_conn = NULL;
	k_work_cancel_delayable(&headsets[chan_idx].stream_start_sink_work);
	headsets[chan_idx].sink_ep = NULL;
	memset(headsets[chan_idx].sink_codec_cap, 0, sizeof(headsets[chan_idx].sink_codec_cap));
	k_work_cancel_delayable(&headsets[chan_idx].stream_start_source_work);
	headsets[chan_idx].source_ep = NULL;
	memset(headsets[chan_idx].source_codec_cap, 0, sizeof(headsets[chan_idx].source_codec_cap));

	headsets[chan_idx].num_eps = 0;
}

static int discover_sink(struct bt_conn *conn)
{
	int ret;
	static uint8_t discover_index;

	unicast_client_cbs.discover = discover_sink_cb;

